In [1]:
import pandas as pd
df1 = pd.read_csv('Auto.csv') # if data set and code are available in same folder 
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [4]:
# df1 = pd.read_csv(r'C:\Users\admin\2703\Auto.csv') # if dataset is in different folder
# df1 = pd.read_csv('C:\\Users\\admin\\2703\\Auto.csv') # replace \ with \\
# df1 = pd.read_csv('C:/Users/admin/2703/Auto.csv') # replace \ with / 
# df1.head(2)

In [5]:
df1.shape

(397, 9)

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [8]:
# df1.isnull() # go through each and every row and check is the value Null 
df1.isnull().sum() # Count True from the output of isnull()

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

### Data Cleaning

##### Data type conversion

In [ ]:
boolean --> int --> flaot --> complex --> string

In [12]:
pd.Series([1,2,3,4,5,'a' ])

0    1
1    2
2    3
3    4
4    5
5    a
dtype: object

In [ ]:
'1'

In [13]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [14]:
df1['weight'].astype(float)

0      3504.0
1      3693.0
2      3436.0
3      3433.0
4      3449.0
        ...
392    2790.0
393    2130.0
394    2295.0
395    2625.0
396    2720.0
Name: weight, Length: 397, dtype: float64

In [15]:
df1['Horse Power'].astype(int)

ValueError: invalid literal for int() with base 10: '?'

In [16]:
int('200')

200

In [17]:
int('?')

ValueError: invalid literal for int() with base 10: '?'

In [18]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [20]:
df1['weight'] =  df1['weight'].astype(float)
# we are storing the output generated by astype(float) into the same column ( over riding)

In [21]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693.0,11.5,70,1,buick skylark 320

In [29]:
df1['Horse Power'].isnull().sum() # before conversion there are 0 blank values

5

In [26]:
df1['Horse Power'] =  pd.to_numeric(df1['Horse Power'], errors = 'coerce')
# coerce --> when encoutered any error while conversion to numeric it will replaced by null values

In [27]:
df1['Horse Power'].isnull().sum() # before conversion there are 0 blank values

5

##### Treat missing values

In [30]:
df1.isnull().sum()

mpg             5
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [31]:
df1.shape

(397, 9)

In [38]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150.0,3433.0,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140.0,3449.0,10.5,70,1,ford torino
5,NaN,8.0,NaN,198.0,4341.0,10.0,70,1,ford galaxie 500
6,NaN,8.0,NaN,220.0,4354.0,9.0,70,1,chevrolet impala
7,14.0,8.0,NaN,215.0,4312.0,8.5,70,1,plymouth fury iii
8,14.0,8.0,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl

In [35]:
df2 =  df1.dropna()
df2.shape # after dropping rows where the value is missing

(383, 9)

In [39]:
df2

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
8,14.0,8.0,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl
10,15.0,8.0,383.0,170.0,3563.0,10.0,70,1,dodge challenger se
...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790.0,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52.0,2130.0,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84.0,2295.0,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79.0,2625.0,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82.0,2720.0,19.4,82,1,chevy s-10

In [40]:
# replace that missing value with something else ( mean / median )
df1['mpg'].mean() # average

23.611734693877548

In [41]:
df1['mpg'] = df1['mpg'].fillna(23.61) # we are filling na/null values with 23.61

In [42]:
df1.isnull().sum()

mpg             0
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

#### Drop Unnecessary Columns

In [45]:
# df1 = df1.drop(['year','name'], axis = 1)
df1.drop(['year','name'], axis = 1, inplace = True)
# inplace = True --> it will commit the changes # make the changes permanent in df1
# axis = 1 --> apply that operation on column level # to look for year and name in columns

In [46]:
df1.head(2)

    mpg  cylinders  displacement  Horse Power  weight  acceleration  origin
0  18.0        8.0         307.0        130.0  3504.0          12.0       1
1  15.0        8.0         350.0        165.0  3693.0          11.5       1

#### Rename columns

In [47]:
df1.rename({'Horse Power': 'horse_power'}, axis = 1, inplace = True) # look Horse Power in column names 
df1.head(2)

    mpg  cylinders  displacement  horse_power  weight  acceleration  origin
0  18.0        8.0         307.0        130.0  3504.0          12.0       1
1  15.0        8.0         350.0        165.0  3693.0          11.5       1

### Data Manipulation

In [48]:
df1.head(10)

     mpg  cylinders  displacement  horse_power  weight  acceleration  origin
0  18.00        8.0         307.0        130.0  3504.0          12.0       1
1  15.00        8.0         350.0        165.0  3693.0          11.5       1
2  23.61        8.0         318.0        150.0  3436.0          11.0       1
3  23.61        8.0           NaN        150.0  3433.0          12.0       1
4  23.61        8.0           NaN        140.0  3449.0          10.5       1
5  23.61        8.0           NaN        198.0  4341.0          10.0       1
6  23.61        8.0           NaN        220.0  4354.0           9.0       1
7  14.00        8.0           NaN        215.0  4312.0           8.5       1
8  14.00        8.0         455.0        225.0  4425.0          10.0       1
9  15.00        8.0         390.0        190.0  3850.0           8.5       1

In [49]:
df1.iloc[1:9,1:5]

   cylinders  displacement  horse_power  weight
1        8.0         350.0        165.0  3693.0
2        8.0         318.0        150.0  3436.0
3        8.0           NaN        150.0  3433.0
4        8.0           NaN        140.0  3449.0
5        8.0           NaN        198.0  4341.0
6        8.0           NaN        220.0  4354.0
7        8.0           NaN        215.0  4312.0
8        8.0         455.0        225.0  4425.0

In [ ]:
# loc 
# extract data using names of rows and columns
# column names : mpg, cylinders , 
# row names : as data doesnt have row names so index will become row names
# end value is included

In [50]:
df1.loc[1:9, 'cylinders': 'weight']

   cylinders  displacement  horse_power  weight
1        8.0         350.0        165.0  3693.0
2        8.0         318.0        150.0  3436.0
3        8.0           NaN        150.0  3433.0
4        8.0           NaN        140.0  3449.0
5        8.0           NaN        198.0  4341.0
6        8.0           NaN        220.0  4354.0
7        8.0           NaN        215.0  4312.0
8        8.0         455.0        225.0  4425.0
9        8.0         390.0        190.0  3850.0

#### Create a new column

In [51]:
df1['col1'] = 2 # create a new column called col1 and assign a single value 2 for every row
df1.head(2)

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1
0,18.0,8.0,307.0,130.0,3504.0,12.0,1,2
1,15.0,8.0,350.0,165.0,3693.0,11.5,1,2

In [53]:
df1['col2'] = df1['acceleration'] + df1['col1'] # +, =, * , / , // , % , **
df1.head()

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1,col2
0,18.00,8.0,307.0,130.0,3504.0,12.0,1,2,14.0
1,15.00,8.0,350.0,165.0,3693.0,11.5,1,2,13.5
2,23.61,8.0,318.0,150.0,3436.0,11.0,1,2,13.0
3,23.61,8.0,NaN,150.0,3433.0,12.0,1,2,14.0
4,23.61,8.0,NaN,140.0,3449.0,10.5,1,2,12.5

In [54]:
df1['col3'] = df1['acceleration'] **2
df1.head(2)

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1,col2,col3
0,18.0,8.0,307.0,130.0,3504.0,12.0,1,2,14.0,144.00
1,15.0,8.0,350.0,165.0,3693.0,11.5,1,2,13.5,132.25

#### Applying function on dataset

In [55]:
def sqr_num(n): # ideally sqr_num saved in pythons memory --> we can use it n number of times
    return n**2

In [56]:
sqr_num(4)

16

In [57]:
df1['col5'] = df1['acceleration'].apply(sqr_num)
df1.head(3)

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1,col2,col3,col5
0,18.00,8.0,307.0,130.0,3504.0,12.0,1,2,14.0,144.00,144.00
1,15.00,8.0,350.0,165.0,3693.0,11.5,1,2,13.5,132.25,132.25
2,23.61,8.0,318.0,150.0,3436.0,11.0,1,2,13.0,121.00,121.00

In [ ]:
# lambda is called anonymous / one time function
# its not saved anywhere

In [58]:
df1['col4'] = df1['acceleration'].apply(lambda x : x**2)
df1.head(3)

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1,col2,col3,col5,col4
0,18.00,8.0,307.0,130.0,3504.0,12.0,1,2,14.0,144.00,144.00,144.00
1,15.00,8.0,350.0,165.0,3693.0,11.5,1,2,13.5,132.25,132.25,132.25
2,23.61,8.0,318.0,150.0,3436.0,11.0,1,2,13.0,121.00,121.00,121.00

In [ ]:
# if cond:
#     out1
# else:
#     out2

# out1 if cond else out2

In [59]:
df1['col6'] = df1['acceleration'].apply(lambda x : 'Even' if x%2 == 0 else 'Odd')
df1.head(3)

,mpg,cylinders,displacement,horse_power,weight,acceleration,origin,col1,col2,col3,col5,col4,col6
0,18.00,8.0,307.0,130.0,3504.0,12.0,1,2,14.0,144.00,144.00,144.00,Even
1,15.00,8.0,350.0,165.0,3693.0,11.5,1,2,13.5,132.25,132.25,132.25,Odd
2,23.61,8.0,318.0,150.0,3436.0,11.0,1,2,13.0,121.00,121.00,121.00,Odd

In [60]:
def add_column(col1, col2):
    return col1+col2

In [61]:
df1.apply(lambda row: add_column(row['acceleration'], row['col1']), axis = 1)

0      14.0
1      13.5
2      13.0
3      14.0
4      12.5
       ...
392    17.6
393    26.6
394    13.6
395    20.6
396    21.4
Length: 397, dtype: float64